run/tutorials/coflowFlame.syngas/system/blockMeshDict
/*---------------------------------------------------------------------------*\               
| =========                 |                                                 |                
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |                
|  \\    /   O peration     | Version:  1.0                                   |                
|   \\  /    A nd           | Web:      http://www.openfoam.org               |                
|    \\/     M anipulation  |                                                 |                
\*---------------------------------------------------------------------------*/                
                                        
FoamFile                                
{                                       
    version         2.0;                
    format          ascii;              
                                        
    root            "";               
    case            "";               
    instance        "";               
    local           "";               
                                        
    class           dictionary;         
    object          blockMeshDict;      
}          


convertToMeters 0.001;  

L     150;
Lm   -8;
Lmm  -8;

R1    4.5;
R1X   4.495716997;
R1Y   0.196287243;
R1Ym -0.196287243;

R2    5.5;
R2X   5.494765218;
R2Y   0.239906630;
R2Ym -0.239906630;

R3    47.5;
R3X   47.45479052;
R3Y    2.07192089;
R3Ym  -2.07192089;
                                         
vertices                                
(                                       
   (0.		0.  	  0.	)   // 0
   ($R1X 	$R1Y      0.	)   // 1
   ($R1X 	$R1Y      $L	)   // 2

   (0. 		0. 	  $L)   // 3
   ($R1X 	$R1Ym     0.)   // 4
   ($R1X 	$R1Ym     $L)   // 5

   (0.		0.	  $Lmm)   // 6
   ($R1X 	$R1Y      $Lmm)   // 7
   ($R1X 	$R1Ym     $Lmm)   // 8

   ($R2X 	$R2Y     0.)   // 9
   ($R2X 	$R2Ym    0.)   // 10
   ($R2X 	$R2Y     $L)   // 11
   ($R2X 	$R2Ym    $L)   // 12

   ($R3X 	$R3Y     	0.)   // 13
   ($R3X 	$R3Ym    	0.)   // 14
   ($R3X 	$R3Y     	$L)   // 15
   ($R3X 	$R3Ym     	$L)   // 16

   ($R2X 	$R2Y     	$Lm)   // 17
   ($R3X 	$R3Y      	$Lm)   // 18
   ($R3X 	$R3Ym   	$Lm)   // 19
   ($R2X 	$R2Ym    	$Lm)   // 20
);

Nfuel      8;
Naxis     50;
NaxisBack  6;
Ncoflow   20;
Nnozzle    2;

Gaxis     30.;
GaxisBack 0.2;
Gcoflow   10.;
Gfuel     0.5;

blocks
( 	
	// Fuel
	hex (6 8 7 6 0 4 1 0)         ($Nfuel   1 $NaxisBack  )  simpleGrading   ($Gfuel  1. $GaxisBack	)
	hex (0 4 1 0 3 5 2 3)         ($Nfuel   1 $Naxis )       simpleGrading   ($Gfuel  1. $Gaxis	)
	
	// Wall
	hex (4 10 9 1 5 12 11 2)      ($Nnozzle  1 $Naxis )       simpleGrading   (1.  1. $Gaxis	)
	
	// Coflow
	hex (20 19 18 17 10 14 13 9)  ($Ncoflow  1 $NaxisBack  )  simpleGrading   ($Gcoflow 1. $GaxisBack	)
	hex (10 14 13 9 12 16 15 11)  ($Ncoflow  1 $Naxis )       simpleGrading   ($Gcoflow 1. $Gaxis		)
);
                                     
edges
    (
        arc 4 1   ($R1 0 0)
        arc 8 7   ($R1 0 $Lmm)
        arc 5 2   ($R1 0 $L)
        arc 10 9  ($R2 0 0)
        arc 20 17 ($R2 0 $Lm)
        arc 12 11 ($R2 0 $L)
        arc 14 13 ($R3 0 0)
        arc 19 18 ($R3 0 $Lm)
        arc 16 15 ($R3 0 $L)

    );                                              
                             
patches                              
(                                    
    patch inletfuel                  
    (                                
        (6 8 7 6)                    
    )                                
                                     
    patch inletair                   
    (                                
        (19 20 17 18)                
    )                                
                                     
    patch outlet                     
    (                                
        (5 3 3 2)                    
        (12 11 2 5)                  
        (16 15 11 12)                  
    )                                
                                     
    empty axis                       
    (                                
        (3 0 0 3)                    
        (0 6 6 0)                    
    )                                
                                     
    wall leftside                    
    (                                              
        (19 18 13 14)
	(14 13 15 16)                
    )                                
                                     
    wall burnerwall                  
    (                                
        (8 7 1 4)                    
        (10 9 17 20)                 
        (4 1 9 10)                   
    )                                
                                     
    wedge front                      
    (                                
        (1 0 3 2)                    
        (7 6 0 1)                    
        (9 1 2 11)                   
        (13 9 11 15)                 
        (18 17 9 13)                
    )                                
                                     
    wedge back                       
    (                                
	(5 3 0 4)                    
        (4 0 6 8)                    
        (12 5 4 10)                  
        (16 12 10 14)                
        (19 14 10 20)               
    )                                
                                     
);                                   
                                     
mergePatchPairs                      
(                                    
);                                   
                                                                  
